In [17]:
import os
import pandas as pd
import numpy as np

df = pd.read_csv(r"C:\Users\laksh\Desktop\ELAPerformanceTrends.csv", encoding='cp1252')
df.head(10)

,CountyCode,CountyName,DistrictCode,DistrictName,SchoolCode,SchoolName,Grade_Subject,Subject,MetExcExpPerc,Year
0,1,ATLANTIC,10,ABSECON CITY,50,EMMA C ATTALES,Grade 5,LAL,47,2017-18
1,1,ATLANTIC,10,ABSECON CITY,50,EMMA C ATTALES,Grade 6,LAL,59,2017-18
2,1,ATLANTIC,10,ABSECON CITY,50,EMMA C ATTALES,Grade 7,LAL,64,2017-18
3,1,ATLANTIC,10,ABSECON CITY,50,EMMA C ATTALES,Grade 8,LAL,57,2017-18
4,1,ATLANTIC,10,ABSECON CITY,60,H ASHTON MARSH,Grade 3,LAL,44,2017-18
5,1,ATLANTIC,10,ABSECON CITY,60,H ASHTON MARSH,Grade 4,LAL,54,2017-18
6,1,ATLANTIC,110,ATLANTIC CITY,10,ATLANTIC CITY HIGH SCHOOL,Grade 9,LAL,27,2017-18
7,1,ATLANTIC,110,ATLANTIC CITY,10,ATLANTIC CITY HIGH SCHOOL,Grade 10,LAL,25,2017-18
8,1,ATLANTIC,110,ATLANTIC CITY,10,ATLANTIC CITY HIGH SCHOOL,Grade 11,LAL,19,2017-18
9,1,ATLANTIC,110,ATLANTIC CITY,30,SOVEREIGN AVENUE SCHOOL,Grade 3,LAL,40,2017-18

In [19]:
df.isnull().sum()

CountyCode       0
CountyName       0
DistrictCode     0
DistrictName     0
SchoolCode       0
SchoolName       0
Grade_Subject    0
Subject          0
MetExcExpPerc    0
Year             0
dtype: int64

In [20]:
df.dtypes

CountyCode        int64
CountyName       object
DistrictCode      int64
DistrictName     object
SchoolCode        int64
SchoolName       object
Grade_Subject    object
Subject          object
MetExcExpPerc    object
Year             object
dtype: object

In [34]:
df['MetExcExpPerc'].replace(['*','N'],9999999)

0            47
1            59
2            64
3            57
4            44
5            54
6            27
7            25
8            19
9            40
10           31
11           45
12           41
13           58
14           51
15           44
16           58
17           52
18           27
19           67
20           61
21           16
22           26
23           38
24           26
25           36
26           38
27           13
28      9999999
29      9999999
         ...
7551         42
7552         90
7553         76
7554         48
7555         61
7556         54
7557         61
7558         54
7559         55
7560         47
7561         67
7562         79
7563         46
7564         54
7565         74
7566         22
7567         16
7568         32
7569         27
7570         29
7571         26
7572         35
7573         39
7574         31
7575         54
7576         56
7577         49
7578         69
7579         56
7580         53
Name: MetExcExpPerc, Length: 7581, dtype: object

In [41]:
df = df.replace('N',9999999)

In [42]:
df.loc[df['MetExcExpPerc']=='N']

Empty DataFrame
Columns: [CountyCode, CountyName, DistrictCode, DistrictName, SchoolCode, SchoolName, Grade_Subject, Subject, MetExcExpPerc, Year]
Index: []

In [43]:
df.MetExcExpPerc = df.MetExcExpPerc.astype(float)

In [44]:
df.dtypes

CountyCode         int64
CountyName        object
DistrictCode       int64
DistrictName      object
SchoolCode         int64
SchoolName        object
Grade_Subject     object
Subject           object
MetExcExpPerc    float64
Year              object
dtype: object

In [50]:
df.to_csv('cleanedELAPerformanceTrends2017-18.csv')